tutorials/compressible/sonicFoam/ras/nacaAirfoil/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    INLE1
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    OUTL2
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    SYMP3
    {
        type            empty;
    }

    WALL10
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
